const chechenMappings = {
    basic: {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
        'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
        'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
        'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
        'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch',
        'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': '',
        'э': 'e', 'ю': 'yu', 'я': 'ya'
    },

    
    special: {
        'гӏ': 'gh', 'кх': 'kh', 'къ': 'q', 'хь': 'h',
        'цӏ': 'c', 'чӏ': 'ch', 'хӏ': 'h', 'ӏ': '',
        'аь': 'a', 'уь': 'u', 'оь': 'o'
    },

    
    arabic: {
        'а': 'ا', 'б': 'ب', 'в': 'ڤ', 'г': 'گ', 'д': 'د',
        'е': 'ه', 'ё': 'يو', 'ж': 'ج', 'з': 'ز', 'и': 'ى',
        'й': 'ی', 'к': 'ک', 'л': 'ل', 'м': 'م', 'н': 'ن',
        'о': 'و', 'п': 'پ', 'р': 'ر', 'с': 'س', 'т': 'ت',
        'у': 'ۇ', 'ф': 'ف', 'х': 'خ', 'ц': 'څ', 'ч': 'چ',
        'ш': 'ش', 'щ': 'شچ', 'ъ': 'ع', 'ы': 'ى', 'ь': '',
        'э': 'ه', 'ю': 'يۇ', 'я': 'يا',
        
        'гӏ': 'غ', 'кх': 'ڪ', 'къ': 'ق', 'хь': 'ح',
        'цӏ': 'ص', 'чӏ': 'چ', 'хӏ': 'ھ', 'ӏ': 'ع',
        'аь': 'ى', 'уь': 'ۆ', 'оь': 'ۅ'
    }
};


const tatarMappings = {

    basic: {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
        'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
        'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
        'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
        'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch',
        'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': 'ь',
        'э': 'e', 'ю': 'yu', 'я': 'ya'
    },

    special: {
        'ә': 'ä', 'ң': 'ñ', 'ө': 'ö', 'ү': 'ü', 'һ': 'h',
        'җ': 'j', 'ў': 'ü'
    },

    arabic: {
        'а': 'ا', 'ә': 'ە', 'б': 'ب', 'в': 'و', 'г': 'گ',
        'д': 'د', 'е': 'ه', 'ё': 'يو', 'ж': 'ج', 'җ': 'ج',
        'з': 'ز', 'и': 'ى', 'й': 'ي', 'к': 'ك', 'л': 'ل',
        'м': 'م', 'н': 'ن', 'ң': 'ڭ', 'о': 'و', 'ө': 'ۅ',
        'п': 'پ', 'р': 'ر', 'с': 'س', 'т': 'ت', 'у': 'ۇ',
        'ү': 'ۆ', 'ф': 'ف', 'х': 'ح', 'һ': 'ه', 'ц': 'تس',
        'ч': 'چ', 'ш': 'ش', 'щ': 'شچ', 'ъ': 'ع', 'ы': 'ى',
        'ь': '', 'э': 'ه', 'ю': 'يۇ', 'я': 'يا'
    }
};


const circassianMappings = {

    basic: {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
        'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
        'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
        'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
        'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch',
        'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': 'ь',
        'э': 'e', 'ю': 'yu', 'я': 'ya'
    },

    special: {
        'къ': 'q', 'пӏ': 'p', 'лъ': 'l', 'шӏ': 'sh',
        'щӏ': 'sch', 'ӏ': ''
    },

    arabic: {
        'а': 'ا', 'б': 'ب', 'в': 'و', 'г': 'گ', 'д': 'د',
        'е': 'ه', 'ё': 'يو', 'ж': 'ج', 'з': 'ز', 'и': 'ى',
        'й': 'ي', 'к': 'ك', 'л': 'ل', 'м': 'م', 'н': 'ن',
        'о': 'و', 'п': 'پ', 'р': 'ر', 'с': 'س', 'т': 'ت',
        'у': 'ۇ', 'ф': 'ف', 'х': 'خ', 'ц': 'څ', 'ч': 'چ',
        'ш': 'ش', 'щ': 'شچ', 'ъ': 'ع', 'ы': 'ى', 'ь': '',
        'э': 'ه', 'ю': 'يۇ', 'я': 'يا',
        
        'гъ': 'غ', 'жъ': 'ژ', 'къ': 'ق', 'кӏ': 'ك',
        'лъ': 'ڵ', 'лӏ': 'ل', 'пӏ': 'پ', 'тӏ': 'ط',
        'фӏ': 'ڡ', 'хъ': 'ح', 'цӏ': 'ص', 'чӏ': 'چ',
        'шъ': 'ش', 'щӏ': 'شچ', 'ӏ': 'ع'
    }
};


const lezginMappings = {

    basic: {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
        'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i',
        'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
        'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
        'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch',
        'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': '',
        'э': 'e', 'ю': 'yu', 'я': 'ya'
    },

    special: {
        'гъ': 'gh', 'гь': 'h', 'къ': 'q', 'кь': 'k',
        'кӏ': 'k', 'пӏ': 'p', 'тӏ': 't', 'уь': 'u',
        'хъ': 'h', 'хь': 'h', 'цӏ': 'c', 'чӏ': 'ch'
    },

    arabic: {
        'а': 'ا', 'б': 'ب', 'в': 'و', 'г': 'گ', 'д': 'د',
        'е': 'ه', 'ё': 'يو', 'ж': 'ج', 'з': 'ز', 'и': 'ى',
        'й': 'ي', 'к': 'ك', 'л': 'ل', 'м': 'م', 'н': 'ن',
        'о': 'و', 'п': 'پ', 'р': 'ر', 'с': 'س', 'т': 'ت',
        'у': 'ۇ', 'ф': 'ف', 'х': 'خ', 'ц': 'څ', 'ч': 'چ',
        'ш': 'ش', 'щ': 'شچ', 'ъ': 'ع', 'ы': 'ى', 'ь': '',
        'э': 'ه', 'ю': 'يۇ', 'я': 'يا',

        'гъ': 'غ', 'гь': 'ه', 'къ': 'ق', 'кь': 'ك',
        'кӏ': 'ك', 'пӏ': 'پ', 'тӏ': 'ط', 'уь': 'ۆ',
        'хъ': 'ح', 'хь': 'ه', 'цӏ': 'ص', 'чӏ': 'چ'
    }
};


export {
    chechenMappings,
    tatarMappings,
    circassianMappings,
    lezginMappings
};